{"config": [{"class_name": "Reshape", "config": {"name": "reshape_1", "batch_input_shape": [null, 32, 1], "trainable": true, "target_shape": [32], "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0"}