{"keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "batch_input_shape": [null, 40, 1], "dtype": "float32", "target_shape": [40, 1]}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "name": "conv1d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "padding": "valid", "filters": 16, "kernel_size": [3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "pool_size": [2], "padding": "valid", "strides": [2]}}, {"class_name": "Conv1D", "config": {"activity_regularizer": null, "name": "conv1d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "padding": "valid", "filters": 16, "kernel_size": [3], "kernel_constraint": null, "data_format": "channels_last", "strides": [1], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "pool_size": [2], "padding": "valid", "strides": [2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 48, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 24, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "linear", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "units": 3, "bias_constraint": null}}], "backend": "tensorflow"}