{"config": [{"config": {"batch_input_shape": [null, 40, 1], "trainable": true, "dtype": "float32", "name": "reshape_1", "target_shape": [40]}, "class_name": "Reshape"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_regularizer": null, "trainable": true, "units": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_regularizer": null, "trainable": true, "units": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "kernel_regularizer": null, "trainable": true, "units": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "kernel_regularizer": null, "trainable": true, "units": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "kernel_regularizer": null, "trainable": true, "units": 16, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "tanh", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_6", "kernel_regularizer": null, "trainable": true, "units": 3, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0"}