{"keras_version": "2.2.0", "config": [{"config": {"trainable": true, "dtype": "float32", "name": "reshape_1", "batch_input_shape": [null, 40, 1], "target_shape": [40]}, "class_name": "Reshape"}, {"config": {"trainable": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_3", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_4", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_5", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "units": 3, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_6", "bias_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}