{"keras_version": "2.2.0", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Reshape", "config": {"target_shape": [40, 2], "name": "reshape_1", "batch_input_shape": [null, 40, 2], "trainable": true, "dtype": "float32"}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1], "strides": [1], "bias_constraint": null, "name": "conv1d_1", "filters": 16, "kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_size": [3], "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "name": "max_pooling1d_1", "trainable": true, "strides": [2], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "dilation_rate": [1], "strides": [1], "bias_constraint": null, "name": "conv1d_2", "filters": 16, "kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_size": [3], "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "name": "max_pooling1d_2", "trainable": true, "strides": [2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 48, "bias_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"units": 24, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"units": 3, "bias_constraint": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}