{"keras_version": "2.2.0", "config": [{"config": {"target_shape": [40], "batch_input_shape": [null, 40, 1], "dtype": "float32", "trainable": true, "name": "reshape_1"}, "class_name": "Reshape"}, {"config": {"units": 16, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"units": 16, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"units": 16, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"units": 16, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"units": 16, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "name": "dense_5"}, "class_name": "Dense"}, {"config": {"units": 3, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "name": "dense_6"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}