{"keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"batch_input_shape": [null, 40, 1], "dtype": "float32", "target_shape": [40], "name": "reshape_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "units": 16, "kernel_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "units": 16, "kernel_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "units": 16, "kernel_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "units": 16, "kernel_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "units": 16, "kernel_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "units": 3, "kernel_regularizer": null, "activation": "linear"}}]}