{"keras_version": "2.2.0", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 40, 1], "name": "reshape_1", "target_shape": [40], "dtype": "float32"}, "class_name": "Reshape"}, {"config": {"units": 16, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_regularizer": null, "name": "dense_3", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_regularizer": null, "name": "dense_4", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"units": 16, "bias_regularizer": null, "name": "dense_5", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"units": 3, "bias_regularizer": null, "name": "dense_6", "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}