{"keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [40], "batch_input_shape": [null, 40, 1]}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 16}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 16}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 16}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_4", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 16}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_5", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 16}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_6", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 3}}], "backend": "tensorflow"}