{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"target_shape": [40, 1], "batch_input_shape": [null, 40, 1], "dtype": "float32", "trainable": true, "name": "reshape_1"}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "dilation_rate": [1], "padding": "valid", "name": "conv1d_1", "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true, "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "pool_size": [2], "trainable": true, "padding": "valid", "strides": [2]}}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "dilation_rate": [1], "padding": "valid", "name": "conv1d_2", "data_format": "channels_last", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1], "activity_regularizer": null, "activation": "relu", "kernel_size": [3], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true, "use_bias": true}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "pool_size": [2], "trainable": true, "padding": "valid", "strides": [2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "trainable": true, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "trainable": true, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "name": "dense_3", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "trainable": true, "use_bias": true}}], "keras_version": "2.2.0"}